from MyMainForm import Ui_MainWindow
from PyQt5 import QtWidgets, QtCore
import random
class MyMainForm(QtWidgets.QMainWindow):

    def __init__(self):
        super().__init__()
        self.__ui = Ui_MainWindow()
        self.__ui.setupUi(self)
        self.showMaximized()
        self.__ui.action_14.triggered.connect(self.sh_w)
        self.__ui.action_15.triggered.connect(self.lon_w)
        self.__ui.action_18.triggered.connect(self.exam)
        self.__ui.action_17.triggered.connect(self.cap_w)
        self.__ui.action_16.triggered.connect(self.Start)
        self.__ui.pushButton.clicked.connect(self.endgame)
        self.__ui.action_20.triggered.connect(self.signs_of_pripen)
        self.__ui.action_21.triggered.connect(self.com_s)
        self.__ui.action_22.triggered.connect(self.exam2)
        self.__ui.action_23.triggered.connect(self.numbers_and_symbols)
        self.__ui.action_24.triggered.connect(self.offers)
        self.__ui.action_25.triggered.connect(self.exam3)
        self.__ui.lineEditEnterText.textChanged.connect(self.onEnterText)
        self.dict=['']
        self.lastTime = 0
        self.allSymbols = 0
        self.allTrueSymbols = 0
        self.timerSec = QtCore.QTimer()
        self.timerSec.timeout.connect(self.onTimer)
        self.__ui.lineEditOutputText.setReadOnly(True)
        self.__ui.lineEditEnterText.setReadOnly(True)
        self.msgChoose = QtWidgets.QMessageBox()


    def Start(self):
        if self.dict != ['']:
            self.__ui.lineEditOutputText.setText('')
            self.__ui.lineEditEnterText.setText('')
            self.onEnterText('')
            self.allSymbols = 0
            self.allTrueSymbols = 0

            if self.lastTime != 0:
                self.secValue = self.lastTime
            else:
                self.secValue = 80
            self.timerSec.start(1000)
            self.__ui.lineEditEnterText.setReadOnly(False)
            self.__ui.pushButton.setVisible(True)
            self.__ui.lineEditEnterText.setReadOnly(False)
        else:
            self.msgChoose.setIcon(QtWidgets.QMessageBox.Information)
            self.msgChoose.setText("Чтоб начать тренировку выберите режим ")
            self.msgChoose.setWindowTitle("Режим не выбран")
            self.msgChoose.show()


    def keyPressEvent(self, event):
        if event.key() == QtCore.Qt.Key_Q:
            self.__ui.lineEditEnterText.setText('Enter')
            event.accept()


    def onEnterText(self, newText):
        if newText != '':
            self.allSymbols += 1
            a = newText[len(newText) - 1]
            if len(self.__ui.lineEditOutputText.text()) != 0:
                b = self.__ui.lineEditOutputText.text()[len(newText) - 1]
                if a != b:
                    newText = newText.removesuffix(a)
                    self.__ui.lineEditEnterText.setText(newText)
                else:
                    self.allTrueSymbols += 1
        if self.__ui.lineEditEnterText.text() == self.__ui.lineEditOutputText.text():
            if (len(self.dict) > 0):
                idx = random.randrange(0, len(self.dict))
                self.__ui.lineEditEnterText.setText('')
                self.__ui.lineEditOutputText.setText(self.dict[idx])
                del self.dict[idx]


    def onTimer(self):
        self.__ui.lineEdit_2.setText(str(self.secValue))
        self.secValue -= 1
        if self.secValue == -1:
            self.timerSec.stop()
            msgBox = QtWidgets.QMessageBox()
            msgBox.setIcon(QtWidgets.QMessageBox.Information)
            msgBox.setText("Натыкано правильных знаков: " + str(self.allTrueSymbols) + "\n" +
                           f"Натыкано не правильных знаков: {self.allSymbols - self.allTrueSymbols}\n" + "Продолжить тренировку?")
            msgBox.setWindowTitle("Конец тренировки")
            self.__ui.lineEditEnterText.setReadOnly(True)
            self.__ui.pushButton.setVisible(False)
            msgBox.setStandardButtons(QtWidgets.QMessageBox.Yes | QtWidgets.QMessageBox.No)

            returnValue = msgBox.exec()
            if returnValue == QtWidgets.QMessageBox.Yes:
                self.reset()
            else:
                self.dict = ['']
                self.__ui.lineEditEnterText.setText("")
                self.__ui.lineEditOutputText.setText("")


    def reset(self):
        self.Start()


    def endgame(self):
        self.lastTime = self.secValue
        self.secValue = 0


    def cap_w(self):
        self.dict = ["Год","Дон","Облако","Солнце","Компьютер", "Золото", "Медведь", "Гараж", "Закон", "Город", "Банан",
                   "Туман", "Жабры", "Жаба","Йога","Ивняк","Йогурт","Кабак","Лабаз","Лава","Лаваш","Арбат",
                   "Линзы","Халат","Цапля","Чада","Шаг","Юг","Ювелир","Юбка","Явка","Аббат","Абажур","Абзац","Багет",
                   "Багор","Багги","База","Бадья","Фото","Есть","Много","Тепло","Книга","Нет","Да","Утро","Карта",
                   "Ясно","Рот","Ведь","Игра","Мясо","Два","Три","Один","Долго","Метр","Тогда","Знать","Сюда","Пора",
                   "Клавиатура","Мышка","Облако","Солнце","Рапира","Расправа","Радар","Рапорт","Разрыв","Разбор",
                   "Размер","Разгром","Растирание","Ротатор","Радиатор","Разработка","Рубероид","Разоружение",
                   "Рзнообразие","Равноправие","Разодрать","Раздробить","Вальс","Вьюга","Верхний","Правда","Никогда",
                   "Правый","Сделать","Играть","Медленно","Писать","Сильно","Ожидать","Женщина","Последний","Купить",
                   "Остаться","Наконец","Вместе","Вообще","Обстоятельство","Единственный","Думать","Государство",]


    def sh_w(self):
        self.dict=["год","дон","облако","солнце","компьютер", "золото", "медведь", "гараж", "закон", "город", "банан",
                   "туман", "жабры", "жаба","йога","ивняк","йогурт","кабак","лабаз","лава","лаваш","арбат",
                   "линзы","халат","цапля","чада","шаг","юг","ювелир","юбка","явка","аббат","абажур","абзац","багет",
                   "багор","багги","база","бадья","фото","есть","много","тепло","книга","нет","да","утро","карта",
                   "ясно","рот","ведь","игра","мясо","два","три","один","долго","метр","тогда","знать","сюда","пора",
                   "утро","легко","он","грязь","надо","куст","такси","что","через","снег","зима","снять","начать","там",
                   "найти","класс","рот","вид","метр","школа","ящик","губы","лететь","доллар","евро","рубль","пять",
                   "обед","ужин","ночь","авто","зал","уши","знак","лампа","тень","свет","крот","земля","икота","шмель",
                   "оса","снуп","роутер","кегля","замок","петля","шёл","нога","гаршок","мозг","шуруп","шнур","звезда"]


    def lon_w(self):
        self.dict=["клавиатура","кышка","облако","солнце","рапира","расправа","радар","рапорт","разрыв","разбор",
                   "размер","разгром","растирание","ротатор","радиатор","разработка","рубероид","разоружение",
                   "разнообразие","равноправие","разодрать","раздробить","вальс","вьюга","верхний","правда","никогда",
                   "правый","сделать","играть","медленно","писать","сильно","ожидать","женщина","последний","купить",
                   "остаться","наконец","вместе","вообще","обстоятельство","единственный","думать","государство",
                   "горячий","смотреть","неужели","толстый","никогда","посмотреть","процесс","почему","парень",
                   "русский","хорошо","привести","компания","остаться","только","горячий","видимо","правда","колесо",
                   "молоко","поздний","сторона","становиться","маленький","тёплый","впереди","последний",
                   "изподвыподверта"]


    def exam(self):
        self.dict = ["Год","Дон","Облако","солнце","компьютер", "золото", "медведь", "гараж", "закон", "город",
                     "банан", "Туман","Клавиатура","Мышка","Облако","Солнце","рапира","Расправа","Радар","рапорт",
                     "Разрыв","Разбор","Размер","Разгром","растирание",
                     "Ротатор", "Радиатор", "Разработка", "Рубероид", "Разоружение", "Разнообразие", "Равноправие",
                     "Разодрать", "Раздробить","Линзы","Халат","Цапля","Чада","Шаг","Юг","Ювелир","Юбка","Явка","Аббат",
                     "Абажур","Абзац","Багет","багор","багги","база","бадья","фото","есть","много","тепло","книга",
                     "нет",
                     "да","утро","карта","ясно","рот","ведь","игра","мясо","два","три","один","долго","метр","тогда",
                     "знать","сюда","пора","утро","легко","он","грязь","надо","куст","такси","что","через","снег",
                     "зима","снять","начать","там","найти","класс","рот","вид","метр","школа","ящик","губы","лететь",
                     "доллар","евро","рубль","пять","обед","ужин","ночь","авто","зал","уши","знак","лампа","тень",
                     "свет","крот","земля","икота","шмель",]


    def signs_of_pripen(self):
        self.dict = [",,,",",,,...","..",".,","..,,", "я,", "ты,", "он,", "она.", "А.С. Пушкин и др,.", "и","пр.,",
                     "Сон,","бал,","Файл,","зуб и т. п.,", "и т.","в.","т.",",,;,;",";,;,;","а,","б;","в,","Г;",",;,;,",
                     ";,,;","да,","Ага;","моря;",",,Буква ю,","Например:",";;::;:;","т.е.","файл.ехе."]


    def com_s(self):
        self.dict = ["Как дела?","Как?","Что?","Где?","Когда?","Зачем?","!!!","???","??!!","!?!?","!!?!","!","?","?!",
                     "Сможешь?","Юго-запад","сколько лет?","альфа_излучение","бета-лучи","социал-демократ",
                     "киловатт-час","ват-час","грамм-молекула","анархо-синдикат","Ростов-на-Дону","умник-разумник",
                     "пол-окна","пол-Краснодара","пол-лейки","путь-дорога","-?!-","!-","-?-","-!","-?","-!-?!",
                     "!!-?-","-!-!??","!?-!"]


    def exam2(self):
        self.dict = ["!","''",",,,",",,,...","..",".,","..,,", "я,", "ты,", "он,", "она.", "А.С. Пушкин и др,.",
                     "и","пр.,",
                     "Сон,","бал,","Файл,","зуб и т. п.,", "и т.","в.","т.",",,;,;",";,;,;","а,","б;","в,","Г;",",;,;,",
                     ";,,;","да,","Ага;","моря;",",,Буква ю,","Например:",";;::;:;","т.е.","файл.ехе.","Как дела?",
                     "Как?",
                     "Что?","Где?","Когда?","Зачем?","!!!","???","??!!","!?!?","!!?!","!","?","?!",
                     "Сможешь?","Юго-запад","сколько лет?","альфа_излучение","бета-лучи","социал-демократ",
                     "киловатт-час","ват-час","грамм-молекула","анархо-синдикат","Ростов-на-Дону","умник-разумник",
                     "пол-окна","пол-Краснодара","пол-лейки","путь-дорога","-?!-","!-","-?-","-!","-?","-!-?!",
                     "!!-?-","-!-!??","!?-!"]


    def numbers_and_symbols(self):
        self.dict = ["2;","3-","4=","5423","4+4=8","123","9=9","83219","+=;","66","69","303","77","0","10","3+3=6",
                     "404","500","3","67","90","3-6=-3","1+1+1=3","900","004","3,14","5/5","//","3/3=1","3*2=6",
                     "*-*","9*0=0","*-+/","*","-","/","..","6.5","99,999","2,2","3.9","1.1","5","5!","5%","68"
                     "6%!","0.9!","|2|","|3|","||","|222|"]


    def offers(self):
        self.dict = ["Родственники-это группа лиц,","периодически собирающаяся",
                     "пересчитаться и вкусно покушать",
                     "изменения в колличестве", "Я знаю точно: невозможное возможно","Сойти с ума",
                     "влюбиться так неосторожно",
                     "найти тебя,", "не отпускать ни днём ни ночью","Всё невозможное-возможно, знаю точно"]


    def exam3(self):
        self.dict = ["Родственники-это группа лиц,","периодически собирающаяся",
                     "пересчитаться и вкусно покушать",
                     "изменения в колличестве", "Я знаю точно: невозможное возможно","Сойти с ума",
                     "влюбиться так неосторожно",
                     "найти тебя,", "не отпускать ни днём ни ночью","Всё невозможное-возможно, знаю точно",
                     "2;", "3-", "4=", "5423", "4+4=8", "123", "9=9", "83219", "+=;", "66", "69", "303", "77", "0",
                     "10", "3+3=6",
                     "404", "500", "3", "67", "90", "3-6=-3", "1+1+1=3", "900", "004", "3,14", "5/5", "//", "3/3=1",
                     "3*2=6",
                     "*-*", "9*0=0", "*-+/", "*", "-", "/", "..","!","''",",,,",",,,...","..",".,","..,,", "я,", "ты,",
                     "он,", "она.", "А.С. Пушкин и др,.",
                     "и","пр.,",
                     "Сон,","бал,","Файл,","зуб и т. п.,", "и т.","в.","т.",",,;,;",";,;,;","а,","б;","в,","Г;",",;,;,",
                     ";,,;","да,","Ага;","моря;",",,Буква ю,","Например:",";;::;:;","т.е.","файл.ехе.","Как дела?",
                     "Как?","Как дела?","Как?","Что?","Где?","Когда?","Зачем?","!!!","???","??!!","!?!?","!!?!","!","?",
                     "?!",
                     "Сможешь?","Юго-запад","сколько лет?",",,,",",,,...","..",".,","..,,", "я,", "ты,", "он,", "она.",
                     "А.С. Пушкин и др,.", "и","пр.,",
                     "Сон,","бал,","Файл,","зуб и т. п.,", "и т.","в.","Год","Дон","Облако","солнце","компьютер",
                     "золото", "медведь", "гараж", "закон", "город",
                     "банан", "Туман","Клавиатура","Мышка","Облако","Солнце","рапира","Расправа","Радар","рапорт",
                     "Разрыв","Разбор","Размер","Разгром","растирание",
                     "Ротатор","клавиатура","кышка","облако","солнце","рапира","расправа","радар","рапорт","разрыв",
                     "разбор",
                      "размер","разгром","растирание","ротатор","радиатор","разработка","рубероид","разоружение",
                      "разнообразие","равноправие","Год","Дон","Облако","Солнце","Компьютер", "Золото", "Медведь",
                      "Гараж",
                     "Закон", "Город", "Банан",
                      "Туман", "Жабры", "Жаба","Йога","Ивняк","Йогурт","Кабак","Лабаз","Лава","Лаваш","Арбат",
                      "Линзы","Халат","Цапля","Чада","Шаг","Юг","Ювелир","Юбка"]



